crApSCII image conversion through J glyphs

#+begin_src j :session :exports both :sit 3
load 'jascii.ijs'
NB. is it a cat? i'm not sure
60 70 (pal0 jascii 0 180) grayscale (3#256) #: readimg 'images/IMG_3026.jpg'
#+end_src

#+RESULTS:
#+begin_example
##&??????????&&@#?*/??@###~#/#@*??****~~~~~~~~**********?????****????&
##&??****????&@#@?*/?&####@#/#@*??****~~~~~~~~*********?????????????&&
##&?????*****@@#@?/??&######/#&*??*****~~~~~~*********????????????&@?~
#@&???????**?@@#&*/**&#####/##????*****~~~~~~********????????????@&*~~
#@???????????@@#&*/**@#####/##????******~~~~~*******?*?????????&@*~~~~
#&??????????&@##?****######/##*??*******~~~~******?/////*?????@?~~~~~~
#&?????????@&&@@****?########@???*******~~~~********~~~*//**&@*~*~~~~~
#&&&&&&&&?&@????****?########&???******~~~~~******~.  ..,**&&***~~~~~,
#&&&&&&&&&&&&????***&########????*******~~~~****??**~.   *&?~~~~,,,,,~
@&&&&&&&&&&&&??????*?########????********~~***?@@##@@~~~?&*~~**~**~~~~
@&&&&&&&&&&@#&?&&&???*?&@####@&&&@@@?&?*~*?@@@####@?*?&&?~~****~~~~~~~
&&&&&&&&&&&@#@???&&?&&??&@############@&&@@#######@&?&????***??*~~,,~~
&&&&&&&&&&&@##@??&&&&@@@###########@&&&@@@@##@@@@@@@@&&&&&????****~~~~
&&&&&&&@@@@####&&&@@@@#######@@##@&??@#@@??&@@@@@@@@@@@@@&&?*~~~~~~~,,
&&&&&&@@@@@####@@@@@#@#####@&@###@&?&@//?~*&@@&&&&&&&&@&&?*?*~~~~~~~~,
//////@@@@@###@&@##@@###@@@&&#//#@&&&&&&*,*?@&???&&&?&&?*?&***~~~,~~,,
??&&&&&@@@@###@@@###@@#@@@@&@#@///??**??~~~?///&@&&?&&&?&&&***~~,,,,,,
~***??/&@@@###@/###@@##@@@@@@@&&&?*~~~~~,,~*???////////////?****~,,,,,
   .. /,*&@@@@@#//@@/@@@@@@@@&?***~,,,,...,~~******??&&&&&&&????~,,,,,
,  **,/  ~&@@@@@&?&//@#@@@@@???~,,.........,,......,,~~***???&&*~~~,,,
     /&?*~&####@*~~~/&@###@&?**,...  ..              .,,~~~**??*?*~~~,
    ./ ~?~&@@@##?@?./~?####&?*~..  ....                .,,~~~~~***?*~~
.. .*/  .~@@@@#&&?,  ,~@/##&?*~,......      *        ///,,,,,,,,~~~***
    / ..,&#####///~ .~*#//@?**~~,,,...      ..   ////,*?&&?*~~~,,~~~~~
    /..,*######&**???*?##/?**~~~~~,,.     ///////.,~?&&&&????**~~,,,~~
  .~/~,,*######@@@@@@@@@&?**~~,,,,.    .    .,~~~*&&&&??????**~~~~,,,,
      .,?@@@@@&&@@@@&&&&?*~,,,,.,,    ..~*???&&@@@@&?*?????***~~,...,,
///  .,~@@&&&&???&&?&&&?**~,.... .    ..~?&&@&&&&??******~~~~,,,.   .,
  /..,&@#@&&&&&&&&?&&&??*~~,...  ... ..,~**??????*******~~,,,,,,,,....
~,~?**&@#@&&&@@&&??&&?***~,.    .,~,.,,~~*????*****~~~~~,,,,,,,,..   .
/..~*?@##@@@@@@@&&&&?~~*~,,.    .,,~~,,~~**??*~~~~,,,,,,,........     
    ~&@#####@@@@@/&*,  ,,..     ,,,~~~~~~***??*~~,,,,.........,,..    
,..~&@######@@@@@/&?,,,.      .,~~~~~,,,,,~~~~~~,~,,,,,,,.............
/~*&@@@@@@@@#@@@&///?*. ///~,~~~~~,,,,,.....,,~~,...........          
,~?&&@@@@@@#@@@@@/@@&///???**~~,,,,,,,,.     .,,..                    
,~?&####@@#@@&&@@&&?&*~?&?**~~~,....,,,...     ....                   
,***&@#@@&@@@@@&&&&???****~~*~,,,,,,,,~,..                             
,***?@@######@&&?&&???*~~**~~,,.... .,,....                      ...   
~~*??&@##@@&&&&&?&&?*~,~~*~~~.......,,,.  ...                         
,*???&@#@@@@@@@@&&?&*,,...,,,~,..  ...,.,.     ...              .      
...,?&@&@@@&&&&&&&&*~~,,,,,.,.... ...   ...... ..                    .
.,~**?@@@&&@#@@&&&@@&??*~~~,,.... ......    ...   ..                ..
~*~~&@&&&@@@@@@&&?&@@&&?*~~~~,,... .   ..........    ..         ..  ..
~,*&&&&&&@&&@@@&&???&&@&?~,~,,..........,....... .      ..............
~*&@&?*~,~@#&?&@@&&???&@@?*~~~,,..,,,,,..,,....           .........,,.
~~,,,,,~&#@?&&#@@&@@@@@@@@&?**~~,,,,,,,,...,,        ...  ......,,,,,,
/.....,&@&?~?@@@@@@@##@@@@@@&??***~~~,,..    ..     ........,,,. .,,,,
,,,,,,??*,,?#@@@@@@@@@@@@@@@&&&??&?*~,,,.     ...........,,,,,,,,...,~
,,,,,~~,,*@###########@@@&&&&&&&&&&?*~,,.,,.. .,.....,.,,,,,,~,,,...,,
......,~&@###############@&@@@@@@@@&&*~,,,....,,,,,,,.,,~~~~~~,,,,...,
......,~@###############@@&@#####@@&?****~,,,.,~~~~~,,,.~**~~~,,,,...,
.....,~@################@&@###@@@&&??&?**~~~,~~~****~~,..~**~~,,,,,...
,,,/,~/&@##############@@#######@@&@&?*??****~,,**??**~,,,*?**,,,,,,..
...//,~?@#############@@######@&&@@???&&?*?*~,.,~*?*??*~~,~*??*,..,,~,
.../.,*###############@#@@###@&@@@&?&@&?*?*~,,.~~*?~*?~~~~~~*??~,...,,
.../,~@#############@&&?@##@@@##@&??@@???&~~,.,~***,**~~~~~~,~**~,,,,,
..,/,?@###########@&&?*&@#@@@@##@??&@&?*??~,,,,~**~,~*~,~~~~~,.~~,,,,,
,,/,~?&@########@&&??*??@&@@@@#@&?&@&?**?*~,,,,~?~~,~*~.~?*~~,,,,,.,~~
,,/,~~&#########&&?????&&##@@##@?&&&&?**?~,,~~~*?*,,,~*~,??*~,,.,...~~
....~&########@@@&&?&?**@##@#@@&&&&&&??**~,~~~~??*~,,~**~*?*~~,,,. .,~
#+end_example
